Repository: crisjar3/api-example
Catalog: src/NetForemost.SharedKernel/Properties/ErrorStrings.*.resx
Languages: es

# Result_EmailNotAvailable
source: Email is not available, please try again.
es: Este correo electrónico no está disponible, inténtalo de nuevo.

# Result_EmailNotFound
source: This email is not associated with any NetForemost account
es: Este correo no está asociado a ninguna cuenta de NetForemost

# Result_EntityNotFound
source: Entity [EntityValue] with id [IdValue] does not found.
es: No se encuentra la entidad [EntityValue] con id [IdValue].

# FailedLogin
source: Incorrect username or password
es: Nombre de usuario o contraseña incorrecta

# Result_GenericCompletedSecurityProcess_Error
source: Thank you for using our services!
es: ¡Gracias por usar nuestros servicios!

# Result_GenericError
source: Sorry an error has occurred, please try again later
es: Lo sentimos, se ha producido un error, inténtelo de nuevo más tarde.

# Result_GenericSecurity_Error
source: Sorry, something went wrong when [Value].
es: Lo sentimos, algo salió mal cuando [Value].

# Result_PasswordRules
source: Passwords must have at least 6 characters, at least one non-alphanumeric character, at least one digit ('0'-'9') and also have at least one uppercase letter ('A'-'Z').
es: Las contraseñas deben tener al menos 6 caracteres, al menos un carácter no alfanumérico, al menos un dígito ('0'-'9') y tambien tener al menos una letra mayúscula ('A'- 'Z').

# Result_ReConfirmAccount
source: Your account has not been verified, please confirm your account first.
es: Su cuenta sido verificado no ha sido verificado por favor confirme su cuenta primero.

# Result_ReOpenFromEmail_Error
source: Please reopen the link from your email.
es: Por favor, vuelva a abrir el enlace de su correo electrónico.

# Result_RequestExpired_Error
source: Your [Value] request has expired, please request the [Value] again.
es: Su solicitud de [Value] ha caducado, solicite el [Value] nuevamente.

# Result_UsernameNotAvalaible
source: Username is not available, please try again.
es: Este nombre de usuario no está disponible, inténtalo de nuevo.

# Result_VerifiedAccount
source: Your account has already been verified before
es: Su cuenta ya ha sido verificada anteriormente

# TimeZoneNotExist
source: The time zone sent does not exist
es: La zona horaria enviada no existe

# UserNotExist
source: The submitted user does not exist
es: El usuario enviado no existe

# UserSettingsExisting
source: This user already has a previously created configuration.
es: Este usuario ya tiene una configuración creada anteriormente.

# UserSettingsNotExist
source: The settings does not exist
es: La configuración no existe.

# Validation_InvalidToken_Error
source: Invalid token
es: Token inválido

# Validation_InvalidToken_UserError
source: The username belongs to the token sent.
es: El nombre de usuario pertenece al token enviado.

# LockedAccount
source: Your account is locked due to too many failed attempts. Please try again after [LockedTimeEnd]
es: Su cuenta está bloqueada debido a demasiados intentos fallidos. Inténtelo de nuevo despues de las [LockedTimeEnd]

# SuspendedUser
source: Your account was suspended indeterminately
es: Su cuenta fue suspendida indeterminadamente

# UserAlreadyHaveCompany
source: There is already a company created for this account, only one company per account is allowed
es: Ya hay una empresa creada para esta cuenta, sólo se permite una empresa por cuenta

# User_NotFound
source: Specified user not found
es: no se ha encontrado el usuario especificado

# CompanySettingsNotFound
source: The company does not have a settings created
es: La compañía no tiene una configuraciones creadas

# CityNotFound
source: The city sent does not found
es: La ciudad enviada no se encontro.

# OneSettingsForCompany
source: There is already a settings created for this company
es: Ya existe una configuración creada para esta empresa.

# CompanyNotRegistered
source: Does not have a registered company
es: No tiene una compañía registrada

# UserHasNotCompany
source: This user does not have a company created
es: Este usuario no tiene una empresa creada

# CountryNotFound
source: The country sent does not found
es: El pais enviado no se encontro.

# CompanyNotFound
source: The company sent does not found
es: La compañia enviada no se encontro.

# BenefitIdNotFound
source: The benefit sent [id] does not found
es: El beneficio enviado [id] no se encontro.

# JobRoleIdNotFound
source: The job role sent [id] does not found
es: El rol de trabajo enviado [id] no se encontro.

# SeniorityIdNotFound
source: The seniority sent [id] does not found
es: El seniority enviado [id] no se encontro.

# SkillIdNotFound
source: The skill sent [id] does not found
es: El skill enviado [id] no se encontro.

# RoleNotFound
source: The role sent [id] does not found
es: El rol enviado [id] no se encontro.

# TalentExistsInTheCompany
source: This talent is already part of the team
es: Este talento ya forma parte del equipo

# UserDoesNotBelongToTheCompany
source: Sorry, you do not belong to the specified company.
es: Lo siento no perteneces a la compañía especificada.

# UserNotAvailableToAddInTeam
source: Talent cannot be added to your team as it has been locked indefinitely.
es: Usuario no disponible para agregar en el equipo

# JobRoleCategoryDuplicated
source: there is already a job role category with the name [name]
es: ya existe una categoria del rol de trabajo con el nombre [name]

# JobRoleCategoryNotFound
source: The job role category sent [id] does not found
es: La categoría de rol de trabajo enviada [id] no se encuentra

# JobRoleDuplicated
source: there is already a job role with the name [name]
es: ya existe un rol de trabajo con el nombre [name]

# ApikeyInvalidFormat
source: api key sent had an invalid format
es: la clave api enviada tenía un formato no válido

# ApiKeyNotFound
source: api key sent does not found
es: no se encuentra la clave api enviada

# ConvertStringToIntList
source: Not could convert the string [value] in a list int
es: No se pudo convertir la cadena [value] en una lista int

# ProjectDatesIncorrect
source: The end date should be greater than the start date
es: la fecha final debe ser mayor que la fecha de inicio.

# ProjectNotFound
source: No project with the ID: [id] was found.
es: El proyecto con el ID: [id] no se encontro.

# ProjectNameDuplicated
source: there is already a registered project with the name : "[name]".
es: ya existe registro un proyecto con el nombre : "[name]"

# ProjectNotOwnedTheCompany
source: The specified project does not belong to the company.
es: el proyecto especificado no pertenece a la empresa

# CompanyUserNotFound
source: The company user specified not found
es: El usuario de compañia no existe

# CompanyUserWithIdNotFound
source: The company user specified with the ID: [id] was not found.
es: El usuario de compañia con el ID: [id] no existe.

# ProjectCompanyUserDuplicated
source: There is already a registration with the specified company user.
es: Ya existe un registro con el usuario de compañia especificado.

# ProjectCompanyUserDuplicatedWithId
source: There is already a registration with the specified company user with the ID: [id].
es: Ya existe un registro con el usuario de compañia especificado con el ID: [id].

# ProjectCompanyUserNotFoundWithId
source: The project company user with the specified ID was not found: [id].
es: El usuario de la compañía no fue encontrado con el ID especificado: [id].

# IndustryNotExist
source: The industry sent does not exist
es: La industria enviada no existe

# JobOfferNotExist
source: The job offer sent not found
es: La oferta de trabajo enviada no se encuentra

# LanguageLevelNotFound
source: The language level sent [id] does not found
es: El nivel de lenguaje enviado [id] no se encontro.

# LanguageNotFound
source: The language sent [id] does not found
es: El lenguaje enviado [id] no se encontro.

# FormatLanguagesIsNotValid
source: The text string sent does not follow the correct pattern "1:2,1:3".
es: La cadena de texto enviada no sigue el patron correcto "1:2,1:3"

# ImageFileEmpty
source: The image file is empty
es: El archivo de imagen se encuentra vacio

# EstimatedHourNotValid
source: Estimated hours must be greater than zero
es: Las horas estimadas deben ser mayor a cero

# GoalStatus_NotFound
source: The goal status specified not found
es: No se ha encontrado el goal status especificado

# InavlidOrderBlockTimeTracking
source: The order of the specified blocks is not correct, they should be sequential.
es: El orden de los bloques especificados no es el correcto, deben ser secuencial.

# TaskNotOwnToUser
source: The specified tasks do not belong to the user.
es: Las tareas especificadas no pertecen al usuario.

# EstimatedHoursExceedMaximunGoalTime
source: Estimated hours exceed the total hours contained in the goal date range.
es: Las horas estimadas exceden el total de horas que contiene el rango de fechas de la meta.

# PriorityLevelNotFound
source: The priority level not found.
es: El nivel prioridad especificado no se encontró.

# StoryPointNotFound
source: The story point specified not found.
es: El punto de historia specificado no se encontró.

# BlockTimeTrackingNotExist
source: The block time tracking not exist.
es: El bloque de seguimiento no existe.

# DailyTrackingHasAlreadyCreated
source: Daily monitoring has already been created.
es: El seguimiento diario ya se ha creado.

# DailyTrackingNotExist
source: The specified daily tracking does not exist.
es: El seguimiento diario especificado no existe.

# UserNotBelongToProject
source: The user does not participate in this project
es: El Usuario no pertenece a este proyecto

# ScrumNotBelongToProject
source: The ScrumMaster does not participate in this project
es: El ScrumMaster no participa en este proyecto.

# EndDateIsInvalid
source: Start date is greater than or equal to end date
es: La fecha de inicio es mayor o igual que la fecha final

# TimeStartIsGreaterThanTimeEnd
source: The time start is greater than time end
es: El tiempo de inicio es mayor que el tiempo final.

# TimeBlockNotBelongToDailyEntry
source: The Time block does not belong to the same date as the dailyentry
es: El Bloque de tiempo no pertenece a la misma fecha que el dailyentry

# TimeStartIsMinorOfLastTimeEnd
source: The start time of the new time block is less than the end time of the last block
es: El tiempo de inicio del nuevo bloque de tiempo es menor que el tiempo final de bloque pasado

# PatchEmptyPropsError
source: Every attribute has to have a value. The next values were empty or NULL: [emptyProps]
es: Todas las propiedades deben contener un valor. Las siguientes propiedades fueron enviadas vacias o NULL: [emptyProps]

# RegisterAlreadyArchived
source: The register you are trying to archive, was previously archived.
es: El registro que estas intentando archivar, ya fue archivado previamente.

# RegisterAlreadyUnarchived
source: The register you are trying to unarchive, was previously unarchived.
es: El registro que estas intentando desarchivar, ya fue desarchivado previamente.

# EmptyProvidedList
source: The list of IDs cannot be empty.
es: La lista de IDs no puede estar vacía.

# TaskTypeNotFound
source: The task types with IDs: [id] were not found in our records
es: Las categorias de tareas con IDs: [id] no fueron encontradas.

# ProjectAvatarNotFound
source: The project avatar with ID: [id] was not found.
es: El avatar del proyecto con ID: [id] no se encontró.

# ProjectAccesibleByEveryoneNotFound
source: No project accesible for everyone was found.
es: No se encontró ningún proyecto accesible por todos.

# EmailExistsInTheCompany
source: There is already a user with this email belonging to this company
es: Ya hay un usuario con este email perteneciente a esta compañia

# InvitationNotSent
source: The invitation could not be sent
es: La invitacion no pudo enviarse

# ProjectNotBelongToCompany
source: The project [Name] does not exist or does not belong to the company
es: El proyecto [Name] , no existe o no pertenece a la compañia
